---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFilter.GetIntegerValue
source: html/f2fc20ab-05c6-2b2c-80dd-86a93d0ddd4c.htm
---
# Autodesk.Revit.DB.ScheduleFilter.GetIntegerValue Method

Gets the filter value for a filter using an integer value.

## Syntax (C#)
```csharp
public int GetIntegerValue()
```

## Returns
The filter value.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The filter value is not an integer.